In [1]:
import pandas as pd

In [51]:
ratings = pd.read_csv("ratings.csv")
# ratings.info()
ratings

        userId  movieId  rating   timestamp
0            1        1     4.0   964982703
1            1        3     4.0   964981247
2            1        6     4.0   964982224
3            1       47     5.0   964983815
4            1       50     5.0   964982931
...        ...      ...     ...         ...
100831     610   166534     4.0  1493848402
100832     610   168248     5.0  1493850091
100833     610   168250     5.0  1494273047
100834     610   168252     5.0  1493846352
100835     610   170875     3.0  1493846415

[100836 rows x 4 columns]

In [35]:
movies = pd.read_csv("movies.csv")
#movies.head()
movies.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9742 entries, 0 to 9741
Data columns (total 3 columns):
movieId    9742 non-null int64
title      9742 non-null object
genres     9742 non-null object
dtypes: int64(1), object(2)
memory usage: 228.5+ KB

#### Какой минимальный рейтинг можно выставить фильму в датасете модуля?

In [28]:
ratings = pd.read_csv("ratings.csv")
r = ratings["rating"].min()
print(r)

0.5

#### Какой максимальный рейтинг можно выставить фильму в датасете модуля?

In [30]:
ratings = pd.read_csv("ratings.csv")
r = ratings["rating"].max()
print(r)

5.0

## Python | Merge, Join and Concatenate DataFrames using Panda

In [31]:
# Python program to concatenate 
# dataframes using Panda 
  
# Creating first dataframe 
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'], 
                    'B': ['B0', 'B1', 'B2', 'B3'], 
                    'C': ['C0', 'C1', 'C2', 'C3'], 
                    'D': ['D0', 'D1', 'D2', 'D3']}, 
                    index = [0, 1, 2, 3]) 
  
# Creating second dataframe 
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'], 
                    'B': ['B4', 'B5', 'B6', 'B7'], 
                    'C': ['C4', 'C5', 'C6', 'C7'], 
                    'D': ['D4', 'D5', 'D6', 'D7']}, 
                    index = [4, 5, 6, 7]) 
  
# Creating third dataframe 
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'], 
                    'B': ['B8', 'B9', 'B10', 'B11'], 
                    'C': ['C8', 'C9', 'C10', 'C11'], 
                    'D': ['D8', 'D9', 'D10', 'D11']}, 
                    index = [8, 9, 10, 11]) 
  
# Concatenating the dataframes 
pd.concat([df1, df2, df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

## Code #2 : DataFrames Merge

In [32]:
# Python program to merge 
# dataframes using Panda 
  
# Dataframe created 
left = pd.DataFrame({'Key': ['K0', 'K1', 'K2', 'K3'], 
                    'A': ['A0', 'A1', 'A2', 'A3'], 
                    'B': ['B0', 'B1', 'B2', 'B3']}) 
  
right = pd.DataFrame({'Key': ['K0', 'K1', 'K2', 'K3'], 
                      'C': ['C0', 'C1', 'C2', 'C3'], 
                      'D': ['D0', 'D1', 'D2', 'D3']}) 
                        
# Merging the dataframes                       
pd.merge(left, right, how ='inner', on ='Key')

  Key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

## Code #3 : DataFrames Join

In [34]:
# Python program to join 
# dataframes using Panda 
  
left = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'], 
                    'B': ['B0', 'B1', 'B2', 'B3']}, 
                    index = ['K0', 'K1', 'K2', 'K3']) 
  
right = pd.DataFrame({'C': ['C0', 'C1', 'C2', 'C3'], 
                      'D': ['D0', 'D1', 'D2', 'D3']}, 
                      index = ['K0', 'K1', 'K2', 'K3']) 
                        
# Joining the dataframes                       
left.join(right)

     A   B   C   D
K0  A0  B0  C0  D0
K1  A1  B1  C1  D1
K2  A2  B2  C2  D2
K3  A3  B3  C3  D3

## В3.2.3 Объединяем таблицы

In [59]:
joined = ratings.merge(movies, on='movieId', how='left')
joined.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 100836 entries, 0 to 100835
Data columns (total 6 columns):
userId       100836 non-null int64
movieId      100836 non-null int64
rating       100836 non-null float64
timestamp    100836 non-null int64
title        215 non-null object
genres       215 non-null object
dtypes: float64(1), int64(3), object(2)
memory usage: 5.4+ MB

#### В каких случаях при объединении датафреймов с помощью merge возникают дубликаты?

Когда одной строке первого датафрейма соответствует несколько строк из второго

In [37]:
import pandas as pd
ratings = pd.read_csv('ratings_example.txt', sep = '\t')
ratings.head()

   userId  movieId  rating   timestamp
0       1       31     2.5  1260759144

In [38]:
movies = pd.read_csv('movies_example.txt', sep = '\t')
movies.head()

   movieId                                      title                   genres
0       31                    Dangerous Minds (1995)                     Drama
1       32  Twelve Monkeys (a.k.a. 12 Monkeys) (1995)  Mystery|Sci-Fi|Thriller
2       31                    Dangerous Minds (1995)                     Drama

#### В текущей версии датасета ratings значение movieId = 31 встречается дважды, а movieId = 32 - один раз. Определите, при каких типах объединения датафреймов ratings и movies по столбцу movieId в итоговом датафрейме останутся оба значения movieId при условии использования следующего синтаксиса:

In [48]:
q = ratings.merge(movies, on = 'movieId', how = "outer")
q.head()

,userId,movieId,rating,timestamp,title,genres
0,1.0,31,2.5,1.260759e+09,Dangerous Minds (1995),Drama
1,1.0,31,2.5,1.260759e+09,Dangerous Minds (1995),Drama
2,NaN,32,NaN,NaN,Twelve Monkeys (a.k.a. 12 Monkeys) (1995),Mystery|Sci-Fi|Thriller

## В3.2.6 Удаляем дубликаты

In [49]:
movies.drop_duplicates(subset = 'movieId', keep = 'first', inplace = True)
movies.head()
# С помощью параметра keep указываем, какой из встречающихся дубликатов оставить (например, первый или последний)
# Параметр inplace указывает, что изменения нужно сохранить в датафрейме, 
# к которому применяется метод (в нашем случае — в датафрейме movies):

   movieId                                      title                   genres
0       31                    Dangerous Minds (1995)                     Drama
1       32  Twelve Monkeys (a.k.a. 12 Monkeys) (1995)  Mystery|Sci-Fi|Thriller

In [50]:
ratings.merge(movies, how = 'left', on = 'movieId')

   userId  movieId  rating   timestamp                    title genres
0       1       31     2.5  1260759144  Dangerous Minds (1995)   Drama

In [72]:
joined = ratings.merge(movies, how='outer')
joined.info()
# total_rows = joined.count
# print(total_rows)

<class 'pandas.core.frame.DataFrame'>
Int64Index: 100836 entries, 0 to 100835
Data columns (total 6 columns):
userId       100836 non-null int64
movieId      100836 non-null int64
rating       100836 non-null float64
timestamp    100836 non-null int64
title        215 non-null object
genres       215 non-null object
dtypes: float64(1), int64(3), object(2)
memory usage: 5.4+ MB

In [73]:
movies = pd.read_csv('movies.csv')
movies[movies.movieId == 3456]

      movieId                                         title genres
2587     3456  Color of Paradise, The (Rang-e khoda) (1999)  Drama

In [75]:
import os
# Не забываем правильно открыть файлы:
files = os.listdir('data') 

# Сначала создаем пустой датафрейм, с названиями нужных столбцов:
data = pd.DataFrame(columns = ['userId', 'movieId', 'rating', 'timestamp'])

# Для каждого имени файла filename будем записывать его содержимое в датафрейм temp 
# и «прибавлять» содержимое очередного файла к data:
for i in files:
        temp = pd.read_csv( os.path.join('data', i), names = ['userId', 'movieId', 'rating', 'timestamp'] )
        data = pd.concat([data, temp])
print(len(data))

100004

### Дополнительные вопросы

 1. зачем пустой дата фрейм?
 2. почему именно такие столбцы?
 3. это что и зачем?  os.path.join('data', i)
 4. и это что такое?  os.path.join('data', i)


1. Мы последовательно открываем каждый файл и записываем его содержимое в датафрейм (temp), но, чтобы объединить все эти датафреймы нам нужен один общий, который мы предварительно и создаем (data)
2. Названия столбцов для датафрейма, которые поясняют, что за данные хранятся в файлах, нам даны из примера этого модуля
3. Также в примере мы узнаем об os.path. Поясню, это является вложенным модулем в модуль os. join - означает соединение, другими словами мы говорим программе: запиши i ( в цикле i это каждый из файлов) в датафрейм data вот в такие столбцы: names = ....
4. А чтобы прибавить конкретный датафрейм к общему, мы используем pd.concat